    export const VEGETABLE_DATA: any = {

    "Zanthoxylum limonella": {
        thai_name: "มะแขว่น",
        local_name: "มะแข่น",
        scientific_name: "Zanthoxylum limonella",
        benefits: "ใบ ขยี้อุดฟันแก้รำมะนาด แก้ปวดฟัน เมล็ดกินแก้ลมวิงเวียน บำรุงโลหิต บำรุงหัวใจ ขับลมในลำไส้ ขับ ปัสสาวะ บำรุงธาตุ ถอนพิษฟกบวม แก้หนองใน รากกับเนื้อไม้ต้มน้ำดื่มขับลมในลำไส้ แก้ลมเบื้องบน หน้ามืดตาลาย วิงเวีย",
        description: "แขว่น เป็นไม้ขนาดกลาง สูงประมาณ 5-10 เมตร มีหนามอยู่รอบลำต้นและกิ่ง ต้นอ่อนจะมีสีแดงแกมเขียว ลักษณะของใบเป็นใบประกอบ แต่ละใบจะมีใบย่อย 10-25 ใบ ช่อดอกเป็นช่อแบบกลุ่มย่อย มีสีขาวอมเทา ยาวประมาณ 10-20 เซนติเมตร มีดอกตัวผู้และดอกตัวเมียอยู่คนละต้น ผลมีกลิ่นหอมเฉพาะตัว",
        recommended_menu: ["ลาบเหนือ","น้ำพริกมะแขว่น","แกงฮังเล"],
        images: [
        "/images/makhwaen1.png",
        "/images/makhwaen2.png",
        "/images/makhwaen3.png"
        ],
    },

    "Neem tree": {
        thai_name: "สะเดา",
        local_name: "สะเลียม",
        scientific_name: "Azadirachta indica",
        benefits: "รักษาโรคไขข้อ ขอบใบสะเดา เมล็ดสะเดา และเปลือกต้น เป็นส่วนที่นำมาใช้เป็นยารักษาโรคไขข้อได้ โดยช่วยลดอาการปวด บวมในข้อ ซึ่งอาจนำมาสกัดเป็นน้ำมันใช้ทาในบริเวณที่มีอาการปวดกล้ามเนื้อ ปวดข้อ และอาการปวดหลังช่วงล่าง ",
        description: "ไม้ต้น ขนาดกลาง สูงประมาณ 5 - 15 เมตร เปลือกต้นสีน้ำตาลเทาหรือเทาปนดำ ลักษณะแตกเป็นร่องตามยาว แตกกิ่งก้านสาขามากมาย บางต้นก็เป็นทรงพุ่มใบ เป็นใบประกอบแบบขนนก ออกเรียงแบบสลับ ลักษณะใบรูปใบหอกแกมรูปไข่ โคนใบเฉียง ขอบใบเป็นจักฟันเลื่อย ดอกสีขาว กลิ่นแรง",
        recommended_menu: ["สะเดาน้ำปลาหวาน","ยำสะเดา"],
        images: [
        "/images/sadao1.png",
        "/images/sadao2.png",
        "/images/sadao3.png"
        ],
    },

    "Broussonetia kurzii": {
        thai_name: "สะแล",
        local_name: "ผักสะแล",
        scientific_name: "Bauhinia purpurea",
        benefits: "ใบ ดอก ลำต้น และราก มารักษาโรคตามตำรายาพื้นบ้านได้อีกด้วย  ภูมิปัญญาชาวบ้านได้มีการนำส่วนของเปลือกและใบสะแลมาต้ม แล้วดื่มแก้อาการบวมที่เกิดจากโรคไต หัวใจพิการ น้ำเหลืองเสีย  นอกจากนี้พืชผักพื้นบ้านอย่างดอกสะแลยังช่วยต้านมะเร็ง ช่วยขับลม แก้ร้อนใน",
        description: "เป็นไม้เถาเนื้ออ่อน ผลัดใบ มีลักษณะเป็นไม้พุ่มเลื้อย ลำต้นสูง 5-10 เมตร ใบเดี่ยว เรียงสลับ รูปไข่หรือรี ปลายใบแหลม โคนใบเว้าเล็กน้อย ขอบใบหยัก ดอกแยกเพศต่างต้น ช่อดอกเพศผู้เป็นช่อยาว ช่อดอกเพศเมียเป็นกระจุก ",
        recommended_menu: ["แกงผักสะแล"],
        images: [
        "/images/salae1.png",
        "/images/salae2.png",
        "/images/salae3.png"
        ],
    },

    "Tupistra albiflora": {
        thai_name: "นางแลว",
        local_name: "ผักนางแลว",
        scientific_name: "Aspidistra sutepensis ",
        benefits: "มีคุณประโยชน์ในทางยา โดยนำรากของต้นลีลาวมาต้มกับน้ำ แล้วนำน้ำที่ได้มาดื่ม จะช่วยบรรเทาอาการเจ็บหลังเจ็บเอวได้เป็นอย่างดี มีรายงานว่า หมอพื้นบ้านทางภาคเหนือใช้รากของต้นลีลาวต้มน้ำรับประทานแก้เจ็บหลังเจ็บเอวเช่นกัน ช่วยลดความดันโลหิต",
        description: "แตกกอมีเหง้าอยู่ใต้ดิน ใบเดี่ยวออกเวียนจากลำต้นใต้ดิน รูปขอบขนาน ปลายใบแหลม แผ่นใบสีเขียวเข้มเป็นมัน ดอกออกจากลำต้นใต้ดิน ตั้งตรงชูก้านดอกขึ้นคล้ายดอกกล้วยไม้ ดอกย่อยสีขาวอมม่วง บานจากล่างขึ้นบน ผลแบบแคปซูล สีเขียวเข้ม ดอกสีขาว ออกเป็นช่อ",
        recommended_menu: ["แกงผักนางแลว"],
        images: [
        "/images/nanglaew1.png",
        "/images/nanglaew2.png",
        "/images/nanglaew3.png"
        ],
    },

    "Para cress": {
        thai_name: "ผักคราดหัวแหวน",
        local_name: "ผักเผ็ด",
        scientific_name: "Acmella oleracea",
        benefits: "ช่วยขับลม บำรุงธาตุ",
        description: "ผักเผ็ดเป็นพืชล้มลุก ลำต้นทอดเลื้อยไปตามผิวดิน ชูยอดขึ้นรับแสง มีขนปกคลุมเล็กน้อย ใบเดี่ยวเรียงตรงข้ามสลับตั้งฉาก รูปไข่ ปลายใบแหลม ขอบใบจักฟันเลื่อย ดอกเป็นช่อออกตามซอกใบใกล้ปลายยอด สีเหลือง เมล็ดรูปรี สีน้ำตาลเข้ม ด้านปลายมีขนช่วยในการกระจายพันธุ์ชอบขึ้นบริเวณที่มีความชุ่มชื้น อินทรีย์วัตถุสูง แสงแดดรำไร ",
        recommended_menu: ["ลาบผักเผ็ด","แกงแค"],
        images: [
        "/images/phak_phet1.png",
        "/images/phak_phet2.png",
        "/images/phak_phet3.png"
        ],
    },

    "RattailedRadish": {
        thai_name: "ผักพฤกษ์",
        local_name: "ผักขี้หูด",
        scientific_name: "Raphanus caudatus",
        benefits: "ฝักและใบช่วยทำให้เจริญอาหาร ใบ ฝัก เนื่องจากผักขี้หูดมีกลิ่นฉุน จึงนิยมนำไปใช้เป็นยาสมุนไพรแก้หวัด ฝัก ช่วยแก้อาการท้องอืดท้องเฟ้อ อาหารไม่ย่อย ใบ ฝักช่วยละลายนิ่ว ดอกเป็นยาช่วยขับน้ำดี ",
        description: "ต้นผักขี้หูด จัดเป็นไม้ล้มลุกมีอายุ 1 ปี หรือ 2 ปี ลำต้นตั้งตรง มีขนแข็งปกคลุมเล็กน้อย ต้นขึ้นเป็นกอเหมือนกับผักกาดเขียว มีความสูงได้ประมาณ 30-100 เซนติเมตร ลำต้นเป็นรูปทรงกลมหรือทรงกระบอก ส่วนกลางของลำต้นจะกลวง ก้านใบแทงขึ้นจากดิน โดยเป็นผักพื้นบ้านทางภาคเหนือ ขยายพันธุ์โดยใช้เมล็ด ชอบขึ้นในที่มีอากาศหนาวเย็นหรือที่มีความชุ่มชื้น หาพบในภาคอื่นได้น้อยมาก ส่วนทางภาคอีสานก็พบได้เฉพาะบนภูสูงเท่านั้น ",
        recommended_menu: ["แกงผักขี้หูด"],
        images: [
        "/images/khee_hud1.png",
        "/images/khee_hud2.png",
        "/images/khee_hud3.png"
        ],
    },

    };
